{
  "name": "Wordpress Feed",
  "identifier": "wordpressposts",
  "description": "¡Transforma tu Web hecha en Wordpress en una App nativa! Con este módulo descarga el contenido de cualquier página y se convertirá en una aplicación móvil dispuesta para todo el mundo. Necesitarás descargar un plugin e instalarlo en la Web: https://wordpress.org/plugins/json-rest-api/",
  "documentation": "# **(How to) Configurar el módulo Wordpress**\r\n\r\nEn **King of App** queremos que crear tu aplicación móvil multiplataforma sea algo sencillo y natural. Así que uno de los primeros módulos que hemos desarrollado es el que posibilita **transformar tu página en Wordpress en una App**. ¿Magia? No, tecnología.\r\n\r\nEn esta serie de tutoriales para que aprendas a usar nuestro builder, ha llegado el momento de explicar nuestra integración en Worpress y lo fácil que te va a resultar transformar esta página web que tanto te gusta en el **contenido nativo** de una App.\r\n\r\n[![wordpress plugin](http://kingofapp.es/wp-content/uploads/2015/11/wordpress-plugin-150x150.png)](http://kingofapp.es/wp-content/uploads/2015/11/wordpress-plugin.png)\r\n\r\nEl primer paso a seguir es instalar un plugin en el Wordpress. Para ello tienes que ir a la siguiente url: [https://wordpress.org/plugins/json-rest-api/](https://wordpress.org/plugins/json-rest-api/). Con él instalado, cualquier página hecha sobre la base de Worpress se transforman en una **API** para que el acceso a los datos que contiene sea inmediato. Y lo mejor es que esto no te llevará ni 10 minutos. A partir de ahí ya puedes ir a nuestro builder para configurar tanto el módulo \"**Worpress Posts**\" como el \"**Wordpress Single**\".\r\n\r\nCada módulo está pensado para cumplir con una necesidad específica. Si bien el módulo \"Worpress Single\" está pensado para presentar un único post, el otro, el \"Wordpress Posts\", te permite elegir un número de publicaciones de cualquiera de las categorías que contenga la página. La manera de configurarlos es bastante similar.\r\n\r\nUna vez en el builder, en la vista de módulos, hay que ir a \"**añadir módulos**\" para acceder a nuestro **Market**. En él, entre muchas otras opciones, podrás encontrar los dos referidos a la integración de Wordpress. Elije el que más de convenga. Pongamos por ejemplo que elijes el \"Wordpress Posts\". Una vez aparece en el builder debes arrastrarlo para **incluirlo dentro del menú** principal para que sea accesible a todos los usuarios de la App.\r\n\r\nPara configurarlo, debes clicar en la opción \"Editar\". Ahí se te abrirá una nueva ventana con cuatro campos a rellenar. El primero es para darle un **nombre** al módulo ya que seguramente el de \"Wordpress Posts\" no te va a gustar demasiado. El segundo es para que introduzcas la **url** del blog que quieres transformar en App. En el caso, por ejemplo de King of App pondríamos: http://kingofapp.es/ (obvio, ¿no?). El tercero de los campos, \"post number\", se refiere al **número de entradas** que quieres que se vean en la App. Ahí puedes poner tantas como quieras. Finalmente, el cuarto elemento a editar es la **categoría**. Como bien sabes, las entradas de un blog se dividen en categorías así que elige la que más se adapte a tus necesidades.\r\n\r\n[![wordpress Postst2](http://kingofapp.es/wp-content/uploads/2015/11/wordpress-Postst21-1024x541.png)](http://kingofapp.es/wp-content/uploads/2015/11/wordpress-Postst21.png)  \r\n\r\nCon estos cuatro elementos configurados... Dale a aceptar y ¡listo! tus posts aparecerán en tu App inmediatamente.\r\n\r\n[![Wordpress Posts](http://kingofapp.es/wp-content/uploads/2015/11/Wordpress-Posts1-1024x536.png)](http://kingofapp.es/wp-content/uploads/2015/11/Wordpress-Posts1.png)En cuanto al módulo \"Wordpress Single\" la configuración es bastante similar. Sin embargo, cambian dos campos a rellenar. Los dos primeros son idénticos al anterior configuración, mientras que el tercero y el cuatro varían un poco. El tercer campo a rellenar \"type\" se refiere al **tipo de contenidos** según vaya a ser \"pages\" o \"posts\", mientras que el ID es el número **identificador** de la publicaciónque aparec e en la url de la entrada en el momento en que la estamos editando desde el panel de control de wordpress. Por ejemplo en el caso del contenido de la imagen adjunta, al tratarse de un post, en el \"type\" le hemos puesto \"posts\". Para el ID nos hemos fijado en la siguiente url: http://kingofapp.es/wp-admin/post.php?post=31811 de la que resulta que **31811** es precisamente el código que debemos introducir en este cuarto campo. No es complicado para nada, ¿verdad?[![wordpress single](http://kingofapp.es/wp-content/uploads/2015/11/wordpress-single-1024x541.png)](http://kingofapp.es/wp-content/uploads/2015/11/wordpress-single.png)\r\n\r\nSi **el 25% de las webs del mundo están hechas sobre la base de Wordpress** es más que evidente que muchos de vosotros vais a querer que estos contenidos estén accesibles a todo el mundo vía App. Hasta ahora las plantillas responsive o la creación de webapps eran una solución intermedia. Sin embargo, para todo usuario, no hay nada como una **experiencia de navegación nativa** en móvil así como las otras ventajas que ofrece una App como son las notificaciones push o el acceso directo a múltiples contenidos. Así que no lo pienses más y ¡recurre a nuestros módulos de integración de Wordpress!",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [
    "wordpresssingle"
  ],
  "canContain": false,
  "view": "modules/wordpressposts/index.html",
  "files": ["modules/wordpressposts/controller.js"],
  "scope": {
    "domain": "http://rachelbaker.me",
    "postnumber": 3,
    "category": "",
    "singleurl": "/menu/wordpresssingle"
  },
  "config": [{
    "type": "input",
    "key": "domain",
    "templateOptions": {
      "description": "dominio",
      "pattern": "(https?://)([/\\w.()-]*).*",
      "required": true,
      "label": "domain"
    }
  }, {
    "templateOptions": {
      "label": "postnumber",
      "pattern": "^[0-9]+$",
      "maxlength": 2,
      "required": true,
      "description": "numero del post"
    },
    "type": "input",
    "key": "postnumber"
  }, {
    "type": "input",
    "key": "category",
    "templateOptions": {
      "description": "categoria post",
      "required": true,
      "label": "category"
    }
  }],
  "descriptionShort": "¡Transforma tu web hecha en Wordpress en una App nativa!"
}
