{
  "name": "Contact",
  "identifier": "contact",
  "description": "Activa este m칩dulo si quieres que tus seguidores se pongan en contacto contigo. Solo tendr치s que indicar una direcci칩n de correo y darte de alta en el servicio gratuito de MandrillApp: https://mandrillapp.com/l",
  "documentation": "# **(How to) Configurar el módulo Contact**\r\n\r\nUna de las funciones más evidentes de una App es la de mantener en contacto al usuario con la fuente de información. Poder mandar un correo a un servicio de atención al consumidor, tener línea directa con nuestra marca favorita son elementos de gran valor para todo aquel que se descarga una aplicación móvil. Por ello, en **King of App** hemos desarrollado un módulo gratuito en el que todo usuario podrá **mantener una comunicación fluída**: es el módulo \"_Contact_\" y hoy te enseñamos como funciona y se configura.\r\n\r\nEl módulo que hemos creado se sustenta en le servicio de envío de mailing de **Mandrill**; por ello será necesario que te crees una cuenta en este servicio. Y es que si algo es bueno para que crearlo de cero! Mandrill es una aplicación gratuita si no se supera un máximo de **2.000 envíos** (que son muchos) así que no te preocupes por los costes que te pueda generar aprovecharte de ella.\r\n\r\nUna vez creada la cuenta en [Madrill](https://mandrillapp.com), conseguir el código que te pedimos para configurar el módulo es muy sencillo. Sólo se necesita crear una **API Key** en el apartado de \"_Settings_\". Con ella ya solo tendrás que rellenar el campo con la dirección de correo donde quieres recibir los mails y listo, el módulo ya funcionará correctamente,\r\n\r\nA partir de ahora cualquiera podrá comunicarse vía mail utilizando tu App.",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [],
  "canContain": false,
  "view": "modules/contact/index.html",
  "files": ["modules/contact/controller.js"],
  "scope": {
    "send_address": "info@kingofapp.es",
    "mandrill_key": "XXXX",
    "debug": true
  },
  "config": [{
    "type": "input",
    "key": "send_address",
    "templateOptions": {
      "label": "address",
      "required": true,
      "pattern": "^(([a-zA-Z]|[0-9])|([-]|[_]|[.]))+[@](([a-zA-Z0-9])|([-])){2,63}[.](([a-zA-Z0-9]){2,63})+$",
      "description": "direccion de envio"
    }
  }, {
    "type": "input",
    "key": "mandrill_key",
    "templateOptions": {
      "label": "key mandrill",
      "required": true,
      "description": "key de Mandrill"
    }
  }],
  "descriptionShort": "Activa este m칩dulo si quieres que tus seguidores se pongan en contacto contigo."
}
