{
  "name": "Vimeo Video",
  "identifier": "vimeovideo",
  "description": "Activando este módulo ofrecerás a tus seguidores tus videos ya sea en forma de canal como si tu cuenta es como usuario, en función de la url que entres en el apartado de configuración. Por ejemplo si entras la url de tu canal http://vimeo.com/channels/MiCanal.",
  "documentation": "# **(How to) Configurar el módulo Vimeo Video**\r\n\r\nEl mundo no se acaba en **Youtube**. Servicios de reproducción de vídeo lo hay a montones y, para gustos, colores. Por ello, en **King of App**, hemos querido desarrollar este módulo, el \"**Vimeo Video**\". Con él podrás reproducir en tu App cualquier peiza que hayas subido en esta red social. Aquí te explicamos como configurarlo. Una vez añadido el módulo \"Vimeo Vídeo\" a tu configuración de la App, llega el momento de ver cómo cargamos la información. Lo hacemos de la manera más sencilla que se nos ha ocurrido: con el **ID del vídeo**. ¿Que de dónde sale este identificador? De la URL del propio vídeo. Es decir, sólo con copiar el código que aparece en la URL de la barra de navegación ya podrás configurar este módulo. Por ejemplo, en un vídeo cualquier, la URL acostumbra a ser así: _vimeo.com/84885879_ Pues bien, lo único que debemos entrar en el campo de la identificación son los números que aparecen al final: **84885879**. Tan simple y tan sencillo. **Tus vídeos de Vimeo en tu App**.",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [],
  "canContain": false,
  "view": "modules/vimeovideo/index.html",
  "files": ["modules/vimeovideo/controller.js", "modules/vimeovideo/directive.js"],
  "scope": {
    "videoid": "136882652"
  },
  "config": [{
    "key": "videoid",
    "templateOptions": {
      "label": "id",
      "required": true,
      "pattern": "^[0-9]+$",
      "description": "id del video"
    },
    "type": "input"
  }],
  "descriptionShort": "Ofrece a tus seguidores vídeos procedentes de Vimeo"
}
