{
  "name": "Facebook Feed",
  "identifier": "facebookfeed",
  "description": "Activando este módulo cargarás todo cuanto publiques en Facebook para que tu seguidores lo puedan ver directamente en tu App. Para ello, tendrás que entrar la url de la página de Facebook que quieras compartir. P.e. https://www.facebook.com/pages/King-Of-App así como el AccessToken; para ello deberás acceder a https://developers.facebook.com.",
  "documentation": "# **(How to) Configurar el módulo Facebook**\r\n\r\nUna de las partes más importantes de una App es, sin lugar a duda, su contenido. Hay que meterle cosas que interesen al usuario, de lo contrario nunca la va a encontrar útil para sus propósitos y eso significa la muerte de una App. Incluir un acceso a las rede sociales es un buen punto de partida para que las visitas a una App sean algo recurrente. Por ello, hoy vamos a explicar cómo configurar uno de los módulos más recurrentes en King of App: el de Facebook.\r\n\r\nPara todos es sabido que las redes sociales son elemento clave para fidelizar, por ello en nuestro market de módulos ponemos a vuestra disposición todo tipo de accesos a las principales con lo que sólo hay que elegir la o las que más os convengan. En el caso de hoy, elegiremos el módulo de Facebook. Con él los usuarios de la App tendrán acceso al feed de noticias de la página que elijas.\r\n\r\nCon el módulo cargado en nuestro escritorio de trabajo, llega el momento de configurarlo. Para ello tendrás que clicar en el icono \"Editar\", lógico ¿no?. Ante ti se abrirá una pestaña donde deberás añadir una serie de datos. El primero de ellos es darle nombre al módulo. Es decir, debes decidir cómo quieres que los usuarios vean este módulo. Si no tocas nada se verá como un genérico \"Facebook feed\". Edítalo como te sientas más cómodo, bautízalo.\r\n\r\nUna vez elegido el nombre del módulo llega el momento de entrar los datos reales de configuración. Por un lado va a ser necesario que entres el id de la página. Eso significa copiar la url de destino de la página. Normalmente todas siguen el siguiente esquema:\r\n\r\nhttp://www.facebook.com/pages/Nombre_de_la_Página. Con ello, nosotros podremos ubicarla y saber donde debemos ir a buscar la información.\r\n\r\nEl otro dato ya es algo más complicado pues requiere un paso previo; se trata del acces token. Este código es necesario para que podamos acceder a los datos del feed de la página. Es, para que nos entendamos fácilmente, una llave de acceso. ¿De donde se saca? Muy sencillo, hay que seguir los pasos que desde Facebook se nos indican en su página para desarrolladores: https://developers.facebook.com/docs/facebook-login/access-tokens En este enlace vas a encontrar toda la información necesaria para conseguir este dato.\r\n\r\nSin embaro, como seguro que no tienes ni tiempo ni paciencia, desarrolladores como Cesar Mancilla en su blog (http://cesarmansilla.com/blog) nos lo explican paso a paso:\r\n\r\n_Paso 1: “**Obtener un User access token**”_\r\n\r\n1.  _Ir al Graph API Explorer: [https://developers.facebook.com/tools/explorer/](https://developers.facebook.com/tools/explorer/ \"Graph API Explorer\")_\r\n2.  _Seleccionar la aplicación con la que trabajaremos del menú desplegable_\r\n3.  _Hacer click en el botón “**Get Access Token**“_\r\n4.  _Se abrirá una ventana, vamos a la solapa de “**Extended Permissions**” y debemos tildar el permiso “**manage_pages**” y opcionalmente todos aquellos que creamos necesarios para nuestro programa_\r\n5.  _Click en “**Get Access Token**“. Obtendremos el string con el token en el campo de texto._\r\n\r\n_Paso 2: “**Consultar los pages access token de las fanpages que administramos**”_\r\n\r\n1.  _En el campo para ejecutar llamadas a la API de Facebook esxribiremos: “**me/accounts**“_\r\n2.  _Click en “**Submit**“_\r\n3.  _Obtendremos un listado de fanpages que administramos, deberemos buscar aquella con la que vayamos a trabajar y copiar el valor de “**access_token**“_\r\n\r\n_Este **Page access token** expira luego de 1 hora, por lo que ahora pasaremos al método para obtener uno que no expire nunca:_\r\n\r\n1.  _Necesitamos un **User access token**, lo podremos obtener con el paso 1 visto anteriormente._\r\n2.  _Necesitamos el “**App Secret**“. Entramos al dashboard de nuestra aplicación, hacemos click en el botón “Show” al lado del campo “App Secret”. Nos pedirá nuestra contraseña para mostrar el campo._\r\n    *   _Aquí también tendremos nuestro “**App ID**“_\r\n3.  _Estos 3 datos deberán ser reemplazados en la siguiente URL según corresponda: https://graph.facebook.com/v2.0/oauth/access_token?grant_type=fb_exchange_token&client_id=**[APP-ID]**&client_secret=**[APP-SECRET]**&fb_exchange_token=**[USER-ACCESS-TOKEN]**_\r\n4.  _Una vez reemplazados los datos, los pegamos en un navegador y tocamos enter, allí veremos un string conocido como “**Long lived User Access Token**” que expira en 2 meses._\r\n5.  _Copiamos este token, lo pegamos en el campo “**Access Token**” en el [Graph API Explorer](https://developers.facebook.com/tools/explorer/ \"Graph API Explorer\") y hacemos lo explicado en el paso 2 para obtener un **Page Access Token** que nunca expira._\r\n\r\nCon los tres campos debidamente cumplimentados, ya tenemos el módulo de facebook completamente configurado y listo para ser utilizado en la App.\r\n\r\n¿Fácil, verdad?",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [],
  "canContain": false,
  "view": "modules/facebookfeed/index.html",
  "files": ["modules/facebookfeed/controller.js"],
  "scope": {
    "accesstoken": "XXXX",
    "pageid": "ArchiDesiign"
  },
  "config": [{
    "templateOptions": {
      "label": "accesstoken",
      "required": true,
      "description": "token de acceso"
    },
    "type": "input",
    "key": "accesstoken"
  }, {
    "key": "pageid",
    "templateOptions": {
      "label": "pageid",
      "required": true,
      "description": "id de la pagina"
    },
    "type": "input"
  }],
  "descriptionShort": "Carga todo cuanto publiques en Facebook para que tus seguidores lo vean directamente en tu App."
}
