{
  "name": "Flickr Feed",
  "identifier": "flickrfeed",
  "description": "¿Tienes una galería de fotos en Flickr? Activando este módulo podrás compartirla en tu App. Selecciona este widget y, en el apartado de configuración de contenido, entra la url de tu perfil. P.e. https://www.flickr.com/photos/MiPerfil, así como el access token y el número de fotos que quieres enseñar. El acces token se consigue en la siguiente url: https://www.flickr.com/services/api/auth.oauth.html.",
  "documentation": "# **(How to) Configurar el módulo Flickr**\r\n\r\nLa tríada de módulos específicos para imágenes se completa con dedica do a **Flickr**, una de las **galerías de fotos** más extendidas en el mundo. Por ello, en **King of App** hemos desarrollado este módulo. Aquí te contamos como configurarlo para que en tu App aparezcan todas las galerías que quieras. [![Flickr](http://kingofapp.es/wp-content/uploads/2016/01/Flickr-300x157.png)](http://kingofapp.es/wp-content/uploads/2016/01/Flickr.png)Para configurar el módulo de **Flickr** te pedimos que rellenes tres campos. Por un lado te pedimos un **access token** y por el otro la **identificación de la galería** que quieres cargar y el **número de fotografías** que quieres mostrar en la App. Todos los datos son muy fáciles de conseguir pero quizá el más laborioso es el token. Para conseguir esta credencial hay que dirigirse a la [página de servicios](https://www.flickr.com/services/apps/create/) de Flickr. Aquí tienes el acceso directo. En **tres pasos** vas a conseguir el **Token**. El primer paso es solicitar una **clave API** (en el fondo esta es la clave que necesitarás) pulsando en la ![flickr2](http://kingofapp.es/wp-content/uploads/2016/01/flickr2-300x157.png)opción 1, como se ve en la imagen adjunta. De allí serás redirigido a un formulario, donde **Yahoo**, proveedor de Flickr, te va a pedir un poco de información sobre la clave que necesitas. En función del tipo de App que estés haciendo, elije una opción u otra (imagen2). De ahí, ya solo te quedará un paso para conseguir la credencial y será rellenar un breve cuestionario (varía en función de la opción elegida). Con todo cumplimentado, Flickr te facilitará la clave que debes copiar y pegar en nuestro formulario de configuración. ![flickr3](http://kingofapp.es/wp-content/uploads/2016/01/flickr3-300x159.png) El segundo de los campos de configuración se refiere a la **identificación** de la galería que quieres cargar en el módulo. Esta información **se encuentra en la url** de la propia galería. Fijémonos en una cualquiera: www.flickr.com/photos/111015124@N02/albums/72157650681644318 En ella se pueden observar varias secuencias numéricas. Pues bien, **el ID** se corresponde con la última de llas. En este caso, el identificador, el código que pegaríamos en la configuración del módulo sería el siguiente: _2157650681644318\\._ Con ello ya únicamente faltaría el tercer campo a rellenar. En este caso, no hay que ir a buscar nada; simplemente hay que poner **un valor numérico correspondiente a la cantidad de imágenes que quieres que se carguen**. Con estos res datos, el módulo queda perfectamente configurado y listo para ser usado.",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [],
  "canContain": false,
  "view": "modules/flickrfeed/index.html",
  "files": ["modules/flickrfeed/controller.js"],
  "scope": {
    "accesstoken": "XXXX",
    "photosetid": "72157649175711353",
    "results": "5"
  },
  "config": [{
    "key": "accesstoken",
    "templateOptions": {
      "label": "accesstoken",
      "description": "token de acceso",
      "required": true
    },
    "type": "input"
  }, {
    "type": "input",
    "key": "photosetid",
    "templateOptions": {
      "label": "photosetid",
      "required": true,
      "pattern": "^[a-zA-Z0-9]+$",
      "description": "id del photoset"
    }
  }, {
    "type": "input",
    "key": "results",
    "templateOptions": {
      "label": "results",
      "required": true,
      "maxlength": 2,
      "pattern": "^[0-9]+$",
      "description": "resultados"
    }
  }],
  "descriptionShort": "Activa este módulo para poder compartir en tu App una espectacular galería de imágenes"
}
