{
  "name": "Group List",
  "identifier": "grouplist",
  "description": "Modulo de Group List",
  "documentation": "# **(How to) Configurar el módulo Group List**\r\n\r\nLas opciones a la hora de **diseñar una App** son múltiples. La presentación de los contenidos puede (y debe) variar de una a otroa y, por ello, en **King of App** hemos desarrollado un módulo específico para agrupar estos contenidos que, por cualquier razón, quieras que se mantengan relacionados entre sí. Este es el módulo \"_Group Lis_t\".\r\n\r\nCon este módulo podemos crear una especie de submenú donde desplazarnos por determinados contenidos. Para activarlo, sera necesario acudir al market de módulos y elegirlo. Su configuración es realmente fácil ya que únicamente deberemos elegir qué elementos se incluyen en él a partir de un selector.\r\n\r\n![Group List](http://kingofapp.es/wp-content/uploads/2015/12/Group-List-300x159.png)Por ejemplo, podemos crear un listado de módulos centrado en las imágenes. En él le incluiremos los módulos de \"_Youtube Gallery_\", \"_Youtube Video_\" e \"_Instagram Feed_\".\r\n\r\nDe este modo, se crea un acceso directo a estos módulos en base a un **submenú**.\r\n\r\nLos módulos que se incluyan en el \"_Group List_\" deben estar previamente configurados en el editor y, como siempre, deben estar bajo el régimen de un menú principal. ¿Cómo lo hacemos, entonces, para evitar su duplicidad y que sólo aparezcan como contenido del submenú?\r\n\r\n![duplicidad menú](http://kingofapp.es/wp-content/uploads/2015/12/duplicidad-menú1-300x159.png)Para evitar esta duplicidad que se observa en la segunda imagen de este sencillo tutorial, en King of App hemos habilitado una opción en la configuración de todos los módulos: un checkbox para **habilitar que se muestre o no en el menú**.\r\n\r\nUna rápida configuración que te puede dar mucho juego a la hora de organizar los contenidos de cualquier App. Un módulo que, como todos, se puede **duplicar** y utilizar tantas veces como quieras en tu aplicación.",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [],
  "canContain": false,
  "view": "modules/grouplist/index.html",
  "files": ["modules/grouplist/controller.js"],
  "libs": [{
    "bower": {
      "PolymerElements/iron-flex-layout": "^1.0.0"
    },
    "src": "bower_components/iron-flex-layout/iron-flex-layout.html"
  }, {
    "bower": {
      "": ""
    },
    "src": "modules/grouplist/styles.html"
  }],
  "scope": {
    "sections": ["#/menu/facebook", "#/menu/flickr"]
  },
  "config": [{
    "key": "sections",
    "type": "multiInput",
    "templateOptions": {
      "label": "Elements",
      "inputOptions": {
        "type": "select",
        "templateOptions": {
          "label": "Normal Select",
          "options": []
        }
      }
    }
  }],
  "descriptionShort": "Modulo de Group List"
}
