{
  "name": "Instagram Feed",
  "identifier": "instagramfeed",
  "description": "Para compartir tus fotos en Instagram, debes seleccionar este módulo y en el apartado de configuración del contenido entrar la url de tu perfil. P.e. http://instagram.com/MiPerfil así como un access token que se consigue en el siguiente enlace: https://instagram.com/developer/authentication/",
  "documentation": "# **(How to) Configurar el módulo Instagram**\r\n\r\nSi hay una red social fotográfica por excelencia esta es **Instagram**. Sin duda se ha convertido en escaparate visual y fuente de inspiración para muchos (en clara pugna con **Pinterest**, claro está). En **King of App**, sabedores de la importancia de que una buena imagen vale más que mil palabras, hemos desarrollado un módulo para que puedas enseñar al mundo todas las fotos colgadas en cualquier perfil de Instagram. Hoy aprenderemos como se configura esta funcionalidad. Como es habitual en todos los módulos que se pueden encontrar en nuestro market, la configuración del \"instagram feed\" es igualmente sencilla. Sólo pedimos que se rellenen dos campos: uno con el \"_access token_\" y otro con el _ID_, el identificador de la cuenta. [![Instagram feed configuración](http://kingofapp.es/wp-content/uploads/2015/12/Instagram-feed-configuración-300x159.png)](http://kingofapp.es/wp-content/uploads/2015/12/Instagram-feed-configuración.png)Conseguir estos datos no es nada complicado. Una forma de hacerlo en partiendo de la **documentación para desarrolladores** que el propio Instagram facilita de manera abierta para el acceso a su API. Estas instrucciones se encuentran en el siguiente enlace: _https://instagram.com/developer/authentication/_ Sin embargo, y como nos gusta encontrar herramientas que os faciliten la vida, existen **servicios externos** a esta red social que nos ofrecen estos datos con máxima rapidez y fiabilidad. Para el \"access token\", nuestra recomendación es [Pixelunion](http://instagram.pixelunion.net/). En esta web, con únicamente pulsar un botón se nos facilita este código. ¡Fantástico! Para el ID, el identificador de la cuenta, también podemos acudir a un servicio externo que nos lo dará en menos de un segundo. La web en cuestión es [Strategio](http://lab.strategio.fr/instagram-id.php?lang=es). Dos datos que, como has visto, se consiguen muy fácilmente y que nos darán plena funcionalidad a uno de los módulos más visuales de una App.",
  "type": "A",
  "version": "1.0",
  "author": "King of App",
  "showOn": {
    "menu": true,
    "market": true,
    "dragDrop": true
  },
  "requires": [],
  "canContain": false,
  "view": "modules/instagramfeed/index.html",
  "files": ["modules/instagramfeed/controller.js"],
  "scope": {
    "accesstoken": "XXXXX",
    "userid": "50417061"
  },
  "config": [{
    "type": "input",
    "key": "accesstoken",
    "templateOptions": {
      "label": "accesstoken",
      "required": true,
      "description": "token de acceso"
    }
  }, {
    "type": "input",
    "key": "userid",
    "templateOptions": {
      "description": "id del user",
      "required": true,
      "pattern": "^[0-9]+$",
      "label": "userid"
    }
  }],
  "descriptionShort": "Comparte tus fotos de Instagram dentro de tu app."
}
